Dlubal.DynamPro.IModule
Interface for working with module.

Dlubal.DynamPro.IModule.GetCaseCount
Gets count of cases in this module.
Returns: Count of cases in this modules.

Dlubal.DynamPro.IModule.GetCase(System.Int32,System.UInt32)
Gets module case.
Returns: Module case interface.
No: Number or index of the module case you want to get.
At: Specifies the type of access.

Dlubal.DynamPro.IModule.SetCase(System.Int32,System.String)
Sets the module case. If the case with number exists, just returns its interface.
Returns: Module case interface.
No: Number of the module case. If it is zero or does not exist, new case is added.
Name: Name of the module case to be added.

Dlubal.DynamPro.IModule.DeleteCase(System.Int32,System.UInt32)
Deletes module case based.
No: Number or index of the module case you want to get.
At: Specifies the type of access.

Dlubal.DynamPro.IModule.GetCases
Gets array of module cases.
Returns: Array of module cases

Dlubal.DynamPro.IModule.Clean
Deletes all cases of the module.

Dlubal.DynamPro.IModule.CopyCase(System.Int32,System.UInt32)
Copies case based on given index.
Returns: Module case interface.
No: Number or index of the module case you want to copy.
At: Specifies the type of access.

Dlubal.DynamPro.IModule.HasResults
Checks whether the module has results.
Returns: True when any module's load case has results, false otherwise